---
kind: property
id: P:Autodesk.Revit.DB.DefinitionGroups.IsEmpty
source: html/1c0eb54e-5a16-5190-d4f4-2ae4a79bc362.htm
---
# Autodesk.Revit.DB.DefinitionGroups.IsEmpty Property

Identifies if the definition groups collection is empty.

## Syntax (C#)
```csharp
public bool IsEmpty { get; }
```